Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/tests/test_nrf51822.cpp
/**
 * @file test_nrf51822.cpp
 * @brief nRF51822 BLE co-processor firmware tests.
 *
 * Validates the decompiled nRF51822 firmware behavior against the
 * original BLE_1.1.7.bin Cortex-M0 disassembly findings:
 *
 *   - Initialization sequence (SoftDevice, BLE services, UART, WDT, PSM)
 *   - Ninebot protocol parsing (UART and BLE side, 5A A5 header)
 *   - Checksum calculation (cross-validated with STM32 implementation)
 *   - Protocol relay (UART ↔ BLE transparent bridge)
 *   - MiIO authentication state machine (full flow)
 *   - BLE connection / disconnection handling
 *   - BLE advertising with device name
 *   - PSM persistent token storage / retrieval
 *   - Watchdog feed during main loop
 *   - Binary equivalence: nRF51 checksum vs STM32 calculateChecksum
 *
 * All thresholds and behaviors derived from BLE_1.1.7.bin analysis
 * (282 functions, 58 SVC calls, 554 strings).
 *
 * @see nrf51822_analysis_BLE_1.1.7.txt
 * @see nrf51822-reprogramming.md
 */

#include "test_framework.h"
#include "sim_nrf51.h"
#include "nrf51_firmware.h"
#include "protocol.h"   /* STM32 calculateChecksum / buildPacket for cross-validation */

using namespace ninebot;
using namespace ninebot::nrf51;
using namespace ninebot::sim;


/* =========================================================================
 * Test Fixture
 * ========================================================================= */

struct Nrf51TestFixture {
    SimNrf51Hardware hw;
    Nrf51Hal         hal;
    Nrf51Firmware*   fw = nullptr;

    Nrf51TestFixture() {
        hal = hw.toHal();
        fw  = new Nrf51Firmware(hal);
        fw->init();
    }

    ~Nrf51TestFixture() { delete fw; }

    /** Run N main loop iterations. */
    void tick(uint32_t n = 1) {
        for (uint32_t i = 0; i < n; i++) {
            fw->mainLoopIteration();
        }
    }

    /** Simulate a BLE connection + enable notifications. */
    void connectBle() {
        hw.softdevice.injectConnect(0x0001);
        tick();
        /* Enable notifications by writing to NUS TX CCCD */
        uint8_t cccdVal[2] = {0x01, 0x00};
        /* We need to get the CCCD handle from the firmware — use known offset */
        fw->onGattsWrite(0, cccdVal, 2);  /* handle 0 will be ignored by NUS */
    }

    /** Build a Ninebot packet using the STM32 protocol.h builder. */
    static int buildNb(uint8_t src, uint8_t dst, uint8_t cmd, uint8_t arg,
                       const uint8_t* payload, uint8_t payloadLen,
                       uint8_t* out) {
        return static_cast<int>(
            ninebot::buildPacket(src, dst, cmd, arg, payload, payloadLen, out));
    }
};


/* =========================================================================
 * Initialization Tests
 * =========================================================================
 * Verify the init sequence matches reset handler @ 0x00018155.
 */

TEST(NRF51, InitSoftDeviceEnabled)
{
    Nrf51TestFixture f;
    ASSERT_TRUE(f.hw.softdevice.isEnabled());
}

TEST(NRF51, InitDcdcEnabled)
{
    Nrf51TestFixture f;
    ASSERT_EQ(f.hw.softdevice.dcdcMode(), 1);
}

TEST(NRF51, InitUartEnabled)
{
    Nrf51TestFixture f;
    ASSERT_TRUE(f.hw.uart.isEnabled());
}

TEST(NRF51, InitWatchdogStarted)
{
    Nrf51TestFixture f;
    ASSERT_TRUE(f.hw.wdt.isRunning());
    ASSERT_EQ(f.hw.wdt.timeout(), static_cast<uint32_t>(5000));
}

TEST(NRF51, InitAdvertisingStarted)
{
    Nrf51TestFixture f;
    ASSERT_TRUE(f.hw.softdevice.isAdvertising());
}

TEST(NRF51, InitMiioStateIdle)
{
    Nrf51TestFixture f;
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()), static_cast<uint8_t>(MiioState::IDLE));
}

TEST(NRF51, InitBleNotConnected)
{
    Nrf51TestFixture f;
    ASSERT_FALSE(f.fw->isBleConnected());
    ASSERT_EQ(f.fw->bleConnHandle(), BLE_CONN_HANDLE_INVALID);
}

TEST(NRF51, InitPsmFlashWriteRegistered)
{
    Nrf51TestFixture f;
    ASSERT_TRUE(f.hw.psm.isFlashWriteRegistered());
}

TEST(NRF51, InitAdvDataContainsDeviceName)
{
    Nrf51TestFixture f;
    const auto& adv = f.hw.softdevice.advData();
    ASSERT_GT(adv.size(), static_cast<size_t>(2));
    /* AD type 0x09 = Complete Local Name */
    ASSERT_EQ(adv[1], 0x09);
    /* Check "NBScooter0001" is in advertising data */
    std::string name(adv.begin() + 2, adv.begin() + 2 + (adv[0] - 1));
    ASSERT_EQ(name, std::string("NBScooter0001"));
}

TEST(NRF51, InitGpioPinsConfigured)
{
    Nrf51TestFixture f;
    /* TX pin (P0.08) should be configured as output */
    uint32_t dir = f.hw.gpio.directionReg();
    ASSERT_TRUE((dir >> 8) & 1);  /* P0.08 = output */
}

TEST(NRF51, InitConnectionParametersSet)
{
    Nrf51TestFixture f;
    auto ppcp = f.hw.softdevice.ppcp();
    ASSERT_EQ(ppcp.min, static_cast<uint16_t>(16));       /* 20ms */
    ASSERT_EQ(ppcp.max, static_cast<uint16_t>(32));       /* 40ms */
    ASSERT_EQ(ppcp.latency, static_cast<uint16_t>(0));
    ASSERT_EQ(ppcp.timeout, static_cast<uint16_t>(400));   /* 4s */
}


/* =========================================================================
 * Checksum Tests
 * =========================================================================
 * Cross-validate nRF51822 checksum with STM32 calculateChecksum.
 * Both must produce identical results — same algorithm.
 */

TEST(NRF51, ChecksumMatchesStm32)
{
    /* Test vector: LEN=6, SRC=0x3E, DST=0x20, CMD=0x01, ARG=0x10 */
    uint8_t data[] = {0x06, 0x3E, 0x20, 0x01, 0x10};
    uint16_t nrf = Nrf51Firmware::calcChecksum(data, sizeof(data));
    uint16_t stm = ninebot::calculateChecksum(data, sizeof(data));
    ASSERT_EQ(nrf, stm);
}

TEST(NRF51, ChecksumMatchesStm32WithPayload)
{
    uint8_t data[] = {0x0A, 0x3E, 0x20, 0x64, 0x00, 0xDE, 0xAD, 0xBE, 0xEF};
    uint16_t nrf = Nrf51Firmware::calcChecksum(data, sizeof(data));
    uint16_t stm = ninebot::calculateChecksum(data, sizeof(data));
    ASSERT_EQ(nrf, stm);
}

TEST(NRF51, ChecksumZeroData)
{
    uint8_t data[] = {0x00, 0x00, 0x00, 0x00};
    uint16_t nrf = Nrf51Firmware::calcChecksum(data, sizeof(data));
    ASSERT_EQ(nrf, static_cast<uint16_t>(0xFFFF));
}

TEST(NRF51, ChecksumAllOnes)
{
    uint8_t data[] = {0xFF};
    uint16_t nrf = Nrf51Firmware::calcChecksum(data, 1);
    ASSERT_EQ(nrf, static_cast<uint16_t>(0xFF00));
}


/* =========================================================================
 * Protocol Parsing — UART Side (from STM32)
 * =========================================================================
 * Validates the 5A A5 header detection, length parsing, and checksum
 * verification. Packets from STM32 should be relayed to BLE TX queue.
 */

TEST(NRF51, ParseUartValidPacket)
{
    Nrf51TestFixture f;

    /* Build: App(0x3E) → ESC(0x20), CMD=0x01 READ, ARG=0x10 */
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);

    /* Feed bytes as UART ISR */
    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }

    /* Packet should be in BLE TX queue */
    const auto& bleQ = f.fw->bleTxQueue();
    ASSERT_EQ(bleQ.size(), static_cast<size_t>(1));
    /* Verify relayed packet starts with 5A A5 */
    ASSERT_EQ(bleQ[0][0], static_cast<uint8_t>(0x5A));
    ASSERT_EQ(bleQ[0][1], static_cast<uint8_t>(0xA5));
}

TEST(NRF51, ParseUartBadChecksum)
{
    Nrf51TestFixture f;

    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);

    /* Corrupt the checksum */
    pkt[len - 1] ^= 0xFF;

