Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/tests/test_nrf51822.cpp
    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }

    /* Bad checksum → packet should be dropped */
    ASSERT_EQ(f.fw->bleTxQueue().size(), static_cast<size_t>(0));
}

TEST(NRF51, ParseUartGarbageBeforePacket)
{
    Nrf51TestFixture f;

    /* Feed garbage */
    f.fw->uart0RxIsr(0xDE);
    f.fw->uart0RxIsr(0xAD);
    f.fw->uart0RxIsr(0xBE);
    f.fw->uart0RxIsr(0xEF);

    /* Then a valid packet */
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);
    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }

    ASSERT_EQ(f.fw->bleTxQueue().size(), static_cast<size_t>(1));
}

TEST(NRF51, ParseUartMultiplePackets)
{
    Nrf51TestFixture f;

    /* Send 3 packets back to back */
    for (int p = 0; p < 3; p++) {
        uint8_t pkt[64];
        int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01,
                                            static_cast<uint8_t>(0x10 + p),
                                            nullptr, 0, pkt);
        for (int i = 0; i < len; i++) {
            f.fw->uart0RxIsr(pkt[i]);
        }
    }

    ASSERT_EQ(f.fw->bleTxQueue().size(), static_cast<size_t>(3));
}

TEST(NRF51, ParseUartWithPayload)
{
    Nrf51TestFixture f;

    uint8_t payload[] = {0x01, 0x02, 0x03, 0x04};
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x64, 0x00,
                                        payload, 4, pkt);
    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }

    const auto& bleQ = f.fw->bleTxQueue();
    ASSERT_EQ(bleQ.size(), static_cast<size_t>(1));
    /* Check relayed packet length = payload + frame overhead */
    ASSERT_EQ(bleQ[0].size(), static_cast<size_t>(len));
}


/* =========================================================================
 * Protocol Parsing — BLE Side (from phone app)
 * =========================================================================
 * Packets from phone should be relayed to UART TX queue.
 */

TEST(NRF51, ParseBleValidPacket)
{
    Nrf51TestFixture f;

    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);

    f.fw->feedBleBytes(pkt, static_cast<size_t>(len));

    const auto& uartQ = f.fw->uartTxQueue();
    ASSERT_EQ(uartQ.size(), static_cast<size_t>(1));
    ASSERT_EQ(uartQ[0][0], static_cast<uint8_t>(0x5A));
    ASSERT_EQ(uartQ[0][1], static_cast<uint8_t>(0xA5));
}

TEST(NRF51, ParseBleBadChecksum)
{
    Nrf51TestFixture f;

    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);
    pkt[len - 2] ^= 0xFF;

    f.fw->feedBleBytes(pkt, static_cast<size_t>(len));

    ASSERT_EQ(f.fw->uartTxQueue().size(), static_cast<size_t>(0));
}


/* =========================================================================
 * Protocol Relay Tests
 * =========================================================================
 * The nRF51822 is a transparent bridge — packets from STM32 go to BLE,
 * packets from phone go to UART.
 */

TEST(NRF51, RelayUartToBlePreservesContent)
{
    Nrf51TestFixture f;

    /* Build a packet with payload */
    uint8_t payload[] = {0xCA, 0xFE, 0xBA, 0xBE};
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x64, 0x00,
                                        payload, 4, pkt);

    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }

    const auto& bleQ = f.fw->bleTxQueue();
    ASSERT_EQ(bleQ.size(), static_cast<size_t>(1));

    /* Validate the relayed packet using STM32 validatePacket */
    ASSERT_TRUE(ninebot::validatePacket(bleQ[0].data(), bleQ[0].size()));

    /* Verify src/dst/cmd/arg preserved */
    ASSERT_EQ(bleQ[0][3], static_cast<uint8_t>(0x3E));  /* SRC */
    ASSERT_EQ(bleQ[0][4], static_cast<uint8_t>(0x20));  /* DST */
    ASSERT_EQ(bleQ[0][5], static_cast<uint8_t>(0x64));  /* CMD */
    ASSERT_EQ(bleQ[0][6], static_cast<uint8_t>(0x00));  /* ARG */
}

TEST(NRF51, RelayBleToUartPreservesContent)
{
    Nrf51TestFixture f;

    uint8_t payload[] = {0xDE, 0xAD};
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x22, 0x01, 0x30,
                                        payload, 2, pkt);

    f.fw->feedBleBytes(pkt, static_cast<size_t>(len));

    const auto& uartQ = f.fw->uartTxQueue();
    ASSERT_EQ(uartQ.size(), static_cast<size_t>(1));

    ASSERT_TRUE(ninebot::validatePacket(uartQ[0].data(), uartQ[0].size()));
    ASSERT_EQ(uartQ[0][3], static_cast<uint8_t>(0x3E));
    ASSERT_EQ(uartQ[0][4], static_cast<uint8_t>(0x22));
    ASSERT_EQ(uartQ[0][5], static_cast<uint8_t>(0x01));
    ASSERT_EQ(uartQ[0][6], static_cast<uint8_t>(0x30));
}

TEST(NRF51, RelayUartDrainSendsToHardware)
{
    Nrf51TestFixture f;

    /* Phone→UART: feed BLE bytes → drain UART TX → check hw.uart.txData */
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);
    f.fw->feedBleBytes(pkt, static_cast<size_t>(len));

    /* Drain sends to hardware UART */
    size_t drained = f.fw->drainUartTx();
    ASSERT_GT(drained, static_cast<size_t>(0));

    /* Verify UART hardware received the bytes */
    const auto& txData = f.hw.uart.txData();
    ASSERT_GT(txData.size(), static_cast<size_t>(0));
    ASSERT_EQ(txData[0], static_cast<uint8_t>(0x5A));
    ASSERT_EQ(txData[1], static_cast<uint8_t>(0xA5));

    /* And validatePacket should pass */
    ASSERT_TRUE(ninebot::validatePacket(txData.data(), txData.size()));
}

TEST(NRF51, RelayBytesCountTracking)
{
    Nrf51TestFixture f;

    ASSERT_EQ(f.fw->uartToBleBytes(), static_cast<uint32_t>(0));
    ASSERT_EQ(f.fw->bleToUartBytes(), static_cast<uint32_t>(0));

    /* UART→BLE direction */
    uint8_t pkt1[64];
    int len1 = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt1);
    for (int i = 0; i < len1; i++) {
        f.fw->uart0RxIsr(pkt1[i]);
    }
    ASSERT_GT(f.fw->uartToBleBytes(), static_cast<uint32_t>(0));

    /* BLE→UART direction */
    uint8_t pkt2[64];
    int len2 = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt2);
    f.fw->feedBleBytes(pkt2, static_cast<size_t>(len2));
    ASSERT_GT(f.fw->bleToUartBytes(), static_cast<uint32_t>(0));
}


/* =========================================================================
 * BLE Connection Tests
 * ========================================================================= */

