Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/tests/test_nrf51822.cpp
TEST(NRF51, BleConnectSetsState)
{
    Nrf51TestFixture f;

    ASSERT_FALSE(f.fw->isBleConnected());

    f.hw.softdevice.injectConnect(0x0042);
    f.tick();

    ASSERT_TRUE(f.fw->isBleConnected());
    ASSERT_EQ(f.fw->bleConnHandle(), static_cast<uint16_t>(0x0042));
}


TEST(NRF51, BleConnectStartsMiioAuth)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();

    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::WAIT_AUTH));
}

TEST(NRF51, BleDisconnectResetsState)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();
    ASSERT_TRUE(f.fw->isBleConnected());

    f.hw.softdevice.injectDisconnect();
    f.tick();

    ASSERT_FALSE(f.fw->isBleConnected());
    ASSERT_EQ(f.fw->bleConnHandle(), BLE_CONN_HANDLE_INVALID);
}

TEST(NRF51, BleDisconnectRestartsAdvertising)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();
    ASSERT_FALSE(f.hw.softdevice.isAdvertising());  /* stopped on connect */

    f.hw.softdevice.injectDisconnect();
    f.tick();

    ASSERT_TRUE(f.hw.softdevice.isAdvertising());
}

TEST(NRF51, BleDisconnectResetsMiio)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();
    ASSERT_NE(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::IDLE));

    f.hw.softdevice.injectDisconnect();
    f.tick();

    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::IDLE));
}


/* =========================================================================
 * BLE TX Queue Tests (notification sending)
 * ========================================================================= */

TEST(NRF51, BleTxDrainNotConnectedClearsQueue)
{
    Nrf51TestFixture f;

    /* Not connected — queue packets from UART */
    uint8_t pkt[64];
    int len = Nrf51TestFixture::buildNb(0x3E, 0x20, 0x01, 0x10, nullptr, 0, pkt);
    for (int i = 0; i < len; i++) {
        f.fw->uart0RxIsr(pkt[i]);
    }
    ASSERT_EQ(f.fw->bleTxQueue().size(), static_cast<size_t>(1));

    /* Drain while not connected → queue cleared, no notifications sent */
    f.fw->drainBleTx();
    ASSERT_EQ(f.fw->bleTxQueue().size(), static_cast<size_t>(0));
    ASSERT_EQ(f.hw.softdevice.notificationsSent(), static_cast<uint32_t>(0));
}


/* =========================================================================
 * MiIO Authentication State Machine Tests
 * =========================================================================
 * Tests the complete auth flow:
 *   IDLE → WAIT_AUTH → WAIT_TOKEN → (login confirm) →
 *   (cloud bind) → (app bond) → WAIT_SN → SN_ARRIVED →
 *   REGISTERED → FLASH_REGISTERED
 */

TEST(NRF51, MiioFullAuthFlow)
{
    Nrf51TestFixture f;

    /* Connect */
    f.hw.softdevice.injectConnect(0x0001);
    f.tick();
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::WAIT_AUTH));

    /* Auth write (4+ bytes required) */
    uint8_t authData[8] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08};
    f.fw->onGattsWrite(0xFFFF, authData, 8);  /* non-NUS handle → MiIO path */
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::WAIT_TOKEN));

    /* Token write (16 bytes required) */
    uint8_t token[16] = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF,
                         0x11, 0x22, 0x33, 0x44, 0x55, 0x66,
                         0x77, 0x88, 0x99, 0x00};
    f.fw->onGattsWrite(0xFFFF, token, 16);

    /* After token: login confirm → cloud bind → app bond → WAIT_SN */
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::WAIT_SN));
    ASSERT_TRUE(f.fw->miioReg().cloudBound);
    ASSERT_TRUE(f.fw->miioReg().appBonded);

    /* SN write */
    uint8_t sn[] = "N3MAA14T0001234";
    f.fw->onGattsWrite(0xFFFF, sn, 15);

    /* After SN: register → flash register → FLASH_REGISTERED */
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::FLASH_REGISTERED));
    ASSERT_TRUE(f.fw->isMiioFlashRegistered());
}

TEST(NRF51, MiioAuthTooShortFails)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();

    /* Auth data too short (< 4 bytes) → ERROR */
    uint8_t authData[2] = {0x01, 0x02};
    f.fw->onGattsWrite(0xFFFF, authData, 2);
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::ERROR));
}

TEST(NRF51, MiioTokenTooShortFails)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();

    /* Valid auth */
    uint8_t authData[4] = {0x01, 0x02, 0x03, 0x04};
    f.fw->onGattsWrite(0xFFFF, authData, 4);
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::WAIT_TOKEN));

    /* Token too short (< 16 bytes) → ERROR */
    uint8_t token[8] = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF, 0x11, 0x22};
    f.fw->onGattsWrite(0xFFFF, token, 8);
    ASSERT_EQ(static_cast<uint8_t>(f.fw->miioState()),
              static_cast<uint8_t>(MiioState::ERROR));
}

TEST(NRF51, MiioTokenStoredAfterRegistration)
{
    Nrf51TestFixture f;

    f.hw.softdevice.injectConnect(0x0001);
    f.tick();

    /* Complete auth flow */
    uint8_t auth[4] = {0x01, 0x02, 0x03, 0x04};
    f.fw->onGattsWrite(0xFFFF, auth, 4);

    uint8_t token[16];
    for (int i = 0; i < 16; i++) token[i] = static_cast<uint8_t>(0x10 + i);
    f.fw->onGattsWrite(0xFFFF, token, 16);

    uint8_t sn[] = "TestSN00001";
    f.fw->onGattsWrite(0xFFFF, sn, 11);

    /* Token should be stored in PSM block 0x0001 */
    ASSERT_TRUE(f.hw.psm.hasBlock(0x0001));
    const auto& block = f.hw.psm.getBlock(0x0001);
    ASSERT_EQ(block.size(), static_cast<size_t>(16));
    ASSERT_EQ(block[0], static_cast<uint8_t>(0x10));
    ASSERT_EQ(block[15], static_cast<uint8_t>(0x1F));
}


/* =========================================================================
 * PSM Persistent Storage Tests
 * ========================================================================= */

TEST(NRF51, PsmLoadTokenOnInit)
{
    SimNrf51Hardware hw2;
    /* Pre-load a token before init */
    std::vector<uint8_t> preToken(16, 0x42);
    hw2.psm.preload(0x0001, preToken);

    Nrf51Hal hal2 = hw2.toHal();
    Nrf51Firmware fw2(hal2);
    fw2.init();

    /* Token should have been loaded */
    ASSERT_TRUE(fw2.storedToken().valid);
    ASSERT_EQ(fw2.storedToken().data[0], static_cast<uint8_t>(0x42));
}

