Vicy-DE/Ninebot-G30-Custom/firmware/decompiled/tests/test_nrf51822.cpp
TEST(NRF51, PsmNoTokenEmptyInit)
{
    Nrf51TestFixture f;
    /* No pre-loaded token → storedToken should be invalid */
    ASSERT_FALSE(f.fw->storedToken().valid);
}


/* =========================================================================
 * Watchdog Tests
 * ========================================================================= */

TEST(NRF51, WatchdogFedInMainLoop)
{
    Nrf51TestFixture f;

    uint32_t before = f.hw.wdt.feedCount();
    f.tick(5);
    ASSERT_GE(f.hw.wdt.feedCount(), before + 5);
}


/* =========================================================================
 * Binary Equivalence Tests
 * =========================================================================
 * Feed identical data through both nRF51822 and STM32 protocol paths
 * and verify identical results.
 */

TEST(NRF51, BinaryEquivalencePacketBuild)
{
    /* Build same packet using both STM32 buildPacket and nRF51 enqueue */
    Nrf51TestFixture f;

    uint8_t payload[] = {0x01, 0x02, 0x03};
    uint8_t stmPkt[64];
    int stmLen = static_cast<int>(
        ninebot::buildPacket(0x20, 0x3E, 0x01, 0x10,
                             payload, 3, stmPkt));

    /* Feed same packet from UART → relayed to BLE queue */
    for (int i = 0; i < stmLen; i++) {
        f.fw->uart0RxIsr(stmPkt[i]);
    }

    const auto& bleQ = f.fw->bleTxQueue();
    ASSERT_EQ(bleQ.size(), static_cast<size_t>(1));

    /* nRF51 rebuilt packet should match STM32 packet */
    const auto& nrfPkt = bleQ[0];
    ASSERT_EQ(nrfPkt.size(), static_cast<size_t>(stmLen));
    for (int i = 0; i < stmLen; i++) {
        ASSERT_EQ(nrfPkt[i], stmPkt[i]);
    }
}

TEST(NRF51, BinaryEquivalenceChecksumSweep)
{
    /* Test checksum equivalence for various payload sizes */
    for (uint8_t payloadSize = 0; payloadSize < 32; payloadSize++) {
        std::vector<uint8_t> data(payloadSize + 5);
        data[0] = payloadSize + 6;  /* LEN */
        data[1] = 0x3E;             /* SRC */
        data[2] = 0x20;             /* DST */
        data[3] = 0x01;             /* CMD */
        data[4] = payloadSize;      /* ARG */
        for (uint8_t i = 0; i < payloadSize; i++) {
            data[5 + i] = i;
        }

        uint16_t nrf = Nrf51Firmware::calcChecksum(data.data(), data.size());
        uint16_t stm = ninebot::calculateChecksum(data.data(), data.size());
        ASSERT_EQ(nrf, stm);
    }
}

TEST(NRF51, BinaryEquivalenceRoundTrip)
{
    /* Full round-trip: STM32 build → nRF51 parse → nRF51 rebuild → validate */
    Nrf51TestFixture f;

    uint8_t payload[] = {0xDE, 0xAD, 0xBE, 0xEF, 0xCA, 0xFE};
    uint8_t original[64];
    int origLen = static_cast<int>(
        ninebot::buildPacket(0x20, 0x3E, 0x64, 0x00,
                             payload, 6, original));

    /* UART→BLE relay */
    for (int i = 0; i < origLen; i++) {
        f.fw->uart0RxIsr(original[i]);
    }

    const auto& bleQ = f.fw->bleTxQueue();
    ASSERT_EQ(bleQ.size(), static_cast<size_t>(1));

    /* Validate the rebuilt packet */
    ASSERT_TRUE(ninebot::validatePacket(bleQ[0].data(), bleQ[0].size()));

    /* Parse back: feed the rebuilt packet into a fresh nRF51 BLE parser */
    Nrf51TestFixture f2;
    f2.fw->feedBleBytes(bleQ[0].data(), bleQ[0].size());

    /* Should produce a packet in UART TX queue */
    const auto& uartQ = f2.fw->uartTxQueue();
    ASSERT_EQ(uartQ.size(), static_cast<size_t>(1));

    /* Final packet should be identical to original */
    ASSERT_EQ(uartQ[0].size(), static_cast<size_t>(origLen));
    for (int i = 0; i < origLen; i++) {
        ASSERT_EQ(uartQ[0][i], original[i]);
    }
}


/* =========================================================================
 * Simulator Hardware Tests
 * =========================================================================
 * Verify SimNrf51Hardware components work correctly.
 */

TEST(NRF51, SimUartWiring)
{
    SimNrfUart a, b;
    a.wireTo(&b);

    a.sendByte(0x42);
    ASSERT_TRUE(b.isRxReady());
    ASSERT_EQ(b.receiveByte(), static_cast<uint8_t>(0x42));
}

TEST(NRF51, SimGpioSetClear)
{
    SimNrfGpio gpio;
    gpio.configureOutput(5);
    gpio.setPin(5);
    ASSERT_TRUE(gpio.outputPin(5));
    gpio.clearPin(5);
    ASSERT_FALSE(gpio.outputPin(5));
}

TEST(NRF51, SimTimerStartStop)
{
    SimNrfTimer timer;
    timer.start();
    timer.tick();
    timer.tick();
    ASSERT_EQ(timer.getCounter(), static_cast<uint32_t>(2));
    timer.stop();
    timer.tick();  /* Should not increment when stopped */
    ASSERT_EQ(timer.getCounter(), static_cast<uint32_t>(2));
}

TEST(NRF51, SimSoftDeviceEventInjection)
{
    SimSoftDevice sd;
    sd.bleEnable();
    ASSERT_TRUE(sd.isEnabled());

    sd.injectConnect(0x0001);
    ASSERT_TRUE(sd.isConnected());

    BleEventType type;
    uint16_t handle;
    ASSERT_TRUE(sd.getEvent(type, handle));
    ASSERT_EQ(static_cast<uint16_t>(type),
              static_cast<uint16_t>(BleEventType::CONNECTED));
    ASSERT_EQ(handle, static_cast<uint16_t>(0x0001));
}

TEST(NRF51, SimPsmStoreLoad)
{
    SimPsm psm;
    uint8_t data[4] = {0xCA, 0xFE, 0xBA, 0xBE};
    psm.store(0x0001, data, 4);

    uint8_t out[4] = {};
    uint16_t actualLen = 0;
    ASSERT_TRUE(psm.load(0x0001, out, 4, actualLen));
    ASSERT_EQ(actualLen, static_cast<uint16_t>(4));
    ASSERT_EQ(out[0], static_cast<uint8_t>(0xCA));
    ASSERT_EQ(out[3], static_cast<uint8_t>(0xBE));
}

TEST(NRF51, SimPsmLoadNonexistent)
{
    SimPsm psm;
    uint8_t out[4] = {};
    uint16_t actualLen = 0;
    ASSERT_FALSE(psm.load(0x9999, out, 4, actualLen));
    ASSERT_EQ(actualLen, static_cast<uint16_t>(0));
}

